name: "Gun-Detection-Postprocessing"
backend: "python"
max_batch_size: 0
input [
    {
        name: "output0"
        dims: [-1,6,-1]
        data_type: TYPE_FP32
    }
]
output [
    {
        name: "num_detections"
        data_type: TYPE_INT32
        dims: [1]
    },
    {
        name: "detection_bboxes"
        data_type: TYPE_FP32
        dims: [-1, 4]
    }
]
