backend: "python"
max_batch_size: 0

input [
  {
    name: "input_image"
    data_type: TYPE_FP32
    dims: [ -1,3,640,640 ]  
  },
  {
    name: "detection_bboxes"
    data_type: TYPE_INT32
    dims: [-1, 4 ]  
  }
]

output [
  {
    name: "cropped_image"
    data_type: TYPE_FP32
    dims: [ -1,3,640,640]
  }
]
