backend: "python"
input [
    {
        name: "image"
        data_type: TYPE_UINT8
        dims: [-1, -1, -1]
    }
]
output [
    {
        name: "embeddings"
        data_type: TYPE_FP32,
        dims: [-1, 512]
    },
    {
        name: "detection_bboxes"
        data_type: TYPE_INT32
        dims: [-1, 4]
    }
]
