name: "License-Preprocessing"
backend: "python"
max_batch_size: 0

input [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [-1,3, 1080, 1920]
  }
]

output [
  {
    name: "input_image"
    data_type: TYPE_FP32
    dims: [-1,3, 640, 640]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 2
  }
]
