backend: "python"
input [
    {
        name: "image"
        data_type: TYPE_UINT8
        dims: [-1, -1, -1]
    }
]



output [
   {
        name: "x"
        data_type: TYPE_FP32,
        dims: [-1, -1, -1, -1]
   },
   {
        name:"detection_bboxes"
        data_type: TYPE_INT32
        dims: [-1, 4]
   }
]
