backend: "python"
input [
    {
        name: "image"
        data_type: TYPE_UINT8
        dims: [-1, -1, -1]
    },
    {
        name: "face_locations"
        data_type: TYPE_INT32
        dims: [-1, 4]
    }
]
output [
    {
        name: "embeddings"
        data_type: TYPE_FP32,
        dims: [-1, 128]
    }
]
