name: "Fire-CNN"
backend: "onnxruntime"
input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [1,3,256,256]
  }
]
output[
    {
        name: "output"
        data_type: TYPE_FP32
        dims: [-1,4]
    }
]