platform: "ensemble"
max_batch_size: 0
input [
    {
        name: "images"
        data_type: TYPE_FP32
        dims: [1,3,640,640]
    }
]
output [
  {
    name: "OUTPUT_TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
ensemble_scheduling {
    step [
        {
            model_name: "Car-Detection"
            model_version: 1
            input_map {
                key: "images"
                value: "images"
            }
            output_map {
                key: "output0"
                value: "output0"
            }
        },
        {
            model_name: "Car-Detection-postprocessing"
            model_version: 1
            input_map {
                key: "output0"
                value: "output0"
            }
            output_map{
                key: "detection_bboxes"
                value: "detection_bboxes"
            }
        },
        {
            model_name: "License-Detection-Pre"
            model_version: 1
            input_map{
                key: "input_image"
                value: "images"
            }
            input_map{
                key: "detection_bboxes"
                value: "detection_bboxes"
            }
            output_map{
                key: "cropped_image"
                value: "cropped_image"
            }
        },
        {
            model_name: "License-Detection"
            model_version: 1
            input_map{
                key: "input_image"
                value: "cropped_image"
            }
            output_map{
                key: "output1"
                value: "output1"
            }
        },
        {
            model_name: "License-Detection-Postprocessing"
            model_version: 1
            input_map{
                key: "output1"
                value: "output1"
            }
            output_map{
                key: "det_bboxes"
                value: "det_bboxes"
            }
            output_map{
                key:"bbox_batch_index"
                value:"bbox_batch_index"
            }
        },
        {
            model_name: "Trocr-pre"
            model_version: 1
            input_map{
                key:"input_images"
                value:"images"
            }
            input_map{
                key:"detection_bboxes"
                value:"detection_bboxes"
            }
            input_map{
                key: "det_bboxes"
                value: "det_bboxes"
            }
            input_map{
                key: "bbox_batch_index"
                value: "bbox_batch_index"
            }
            output_map{
                key: "Cropped_Licenses"
                value: "Cropped_Licenses"
            }
        },
        {
            model_name: "trocr"
            model_version: 1
            input_map{
                key: "INPUT_IMAGE"
                value: "Cropped_Licenses"
            }
            output_map{
                key: "OUTPUT_TEXT"
                value: "OUTPUT_TEXT"
            }
        }         
    ]
}
