name: "trocr"
backend: "python"
max_batch_size: 0

input [
  {
    name: "INPUT_IMAGE"
    data_type: TYPE_FP32
    dims: [-1,3,-1,-1 ]  # Height, Width, Channels
  }
]

output [
  {
    name: "OUTPUT_TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]

version_policy: {
  specific { versions: [1] }
}
